//file : one.c
//description : 커서 투명화, 커서 세팅, 디텍트 함수

#include <stdio.h>
#include <stdlib.h>
#include <curses.h>

int BLK[][4][4] = { //** 블록은 모양별로 숫자 행렬로 표현된다. 4행 4열로 표현되며 4개의 회전모양을 갖는다.





			               /*■



					  ■ ■ ■*/



	{



{ 0,0,0,0 },



{ 1,0,0,0 },



{ 1,1,1,0 },



{ 0,0,0,0 } },



	{



{ 0,0,1,0 },



{ 0,0,1,0 },



{ 0,1,1,0 },



{ 0,0,0,0 } },



	{



{ 1,1,1,0 },



{ 0,0,1,0 },



{ 0,0,0,0 },



{ 0,0,0,0 } },



	{



{ 1,1,0,0 },



{ 1,0,0,0 },



{ 1,0,0,0 },



{ 0,0,0,0 } },



/* 두번째블록



         ■



      ■ ■ ■    */



	{



{ 0, 0, 0, 0 },



{ 0, 0, 1, 0 },



{ 1, 1, 1, 0 },



{ 0, 0, 0, 0 } },



{



{ 0, 1, 1, 0 },



{ 0, 0, 1, 0 },



{ 0, 0, 1, 0 },



{ 0, 0, 0, 0 } },



{



{ 1, 1, 1, 0 },



{ 1, 0, 0, 0 },



{ 0, 0, 0, 0 },



{ 0, 0, 0, 0 } },



{



{ 1, 0, 0, 0 },



{ 1, 0, 0, 0 },



{ 1, 1, 0, 0 },



{ 0, 0, 0, 0 } },







/* 세번째블록



   ■



 ■ ■ ■    */



	{



{ 0, 0, 0, 0 },



{ 0, 1, 0, 0 },



{ 1, 1, 1, 0 },



{ 0, 0, 0, 0 } },



{



{ 0, 0, 0, 0 },



{ 0, 1, 0, 0 },



{ 1, 1, 0, 0 },



{ 0, 1, 0, 0 } },



{



{ 0, 0, 0, 0 },



{ 0, 0, 0, 0 },



{ 1, 1, 1, 0 },



{ 0, 1, 0, 0 } },



{



{ 0, 0, 0, 0 },



{ 0, 1, 0, 0 },



{ 0, 1, 1, 0 },



{ 0, 1, 0, 0 } },







/* 네번째블록







■ ■ ■ ■  */



	{



{ 0, 1, 0, 0 },



{ 0, 1, 0, 0 },



{ 0, 1, 0, 0 },



{ 0, 1, 0, 0 } },



{



{ 0, 0, 0, 0 },



{ 0, 0, 0, 0 },



{ 1, 1, 1, 1 },



{ 0, 0, 0, 0 } },



{



{ 0, 1, 0, 0 },



{ 0, 1, 0, 0 },



{ 0, 1, 0, 0 },



{ 0, 1, 0, 0 } },



{



{ 0, 0, 0, 0 },



{ 0, 0, 0, 0 },



{ 1, 1, 1, 1 },



{ 0, 0, 0, 0 } },







/* 다섯번째블록







■ ■



■ ■     */



	{



{ 1, 1, 0, 0 },



{ 1, 1, 0, 0 },



{ 0, 0, 0, 0 },



{ 0, 0, 0, 0 } },



{



{ 1, 1, 0, 0 },



{ 1, 1, 0, 0 },



{ 0, 0, 0, 0 },



{ 0, 0, 0, 0 } },



{



{ 1, 1, 0, 0 },



{ 1, 1, 0, 0 },



{ 0, 0, 0, 0 },



{ 0, 0, 0, 0 } },



{



{ 1, 1, 0, 0 },



{ 1, 1, 0, 0 },



{ 0, 0, 0, 0 },



{ 0, 0, 0, 0 } },











/* 여섯번째블록



  ■ ■



■ ■     */



	{



{ 0, 0, 0, 0 },



{ 0, 1, 1, 0 },



{ 1, 1, 0, 0 },



{ 0, 0, 0, 0 } },



{



{ 0, 1, 0, 0 },



{ 0, 1, 1, 0 },



{ 0, 0, 1, 0 },



{ 0, 0, 0, 0 } },



{



{ 0, 0, 0, 0 },



{ 0, 1, 1, 0 },



{ 1, 1, 0, 0 },



{ 0, 0, 0, 0 } },



{



{ 0, 1, 0, 0 },



{ 0, 1, 1, 0 },



{ 0, 0, 1, 0 },



{ 0, 0, 0, 0 } },







/* 일곱번째블록







■ ■



  ■ ■   */



	{



{ 0, 0, 0, 0 },



{ 1, 1, 0, 0 },



{ 0, 1, 1, 0 },



{ 0, 0, 0, 0 } },



{



{ 0, 0, 1, 0 },



{ 0, 1, 1, 0 },



{ 0, 1, 0, 0 },



{ 0, 0, 0, 0 } },



{



{ 0, 0, 0, 0 },



{ 1, 1, 0, 0 },



{ 0, 1, 1, 0 },



{ 0, 0, 0, 0 } },



{



{ 0, 0, 1, 0 },



{ 0, 1, 1, 0 },



{ 0, 1, 0, 0 },



{ 0, 0, 0, 0 } },







};//블록 모양


void rm_Cursor(void) // 커서를 안 보이게 한다.
{

	curs_set(0);
}

void st_Cursor(int x, int y) // 커서의 위치를 매개변수로 받아 옮긴다.
{
	move(y,x); // int move( 열, 행)
}


int Detect (int rotation, int move_x, int move_y)//보드상 1인지 아닌지 확인하는 함수
{
	int x, y;
	int ARR_X, ARR_Y;
	getyx( stdscr, y, x); 
	// int getsyx(window pointer, int y, int x) 
	// 가상 화면의 커서를 y와 x에 저장하거나 커서를 지정한다. 
	
	ARR_X = x + move_x;
	ARR_Y = y + move_y;

	ARR_X = (ARR_X - 5 )/2; //BD_X = 5
	ARR_Y = ARR_Y - 3; //BD_Y = 3

	for (y=0; y<4; y++)
	{
		for(x=0;x<4;x++)
		{
			if((BLK[rotation][y][x] == 1) && BD[ARR_Y+y][ARR_X+x] ==1)
				return 1;
		}

	}

	return 0;
}

//벽돌생성

void showBlock(int rotation)

{

	int x, y;

	COORD cursor = getCursor();

	int prove;

	//int n=(rotation-1)%4;

	prove = detect(rotation, 0, 0);

	if (prove == 0)

	{

		//콘솔창위치설정배열값에서1은■출력은출력없음

		for (y = 0; y<4; y++)

		{

			for (x = 0; x<4; x++)

			{

				setCursor(cursor.X + (x * 2), cursor.Y + y);

				if (block[rotation][y][x] == 1)

					printf("■");

			}

		}

		setCursor(cursor.X, cursor.Y);

	}

}





void removeBlock(int rotation, int move1, int move2) //벽돌 삭제

{

	int pr;

	int x, y;


	COORD cursor = getCursor();



	pr = detect(rotation, move1, move2);



	if (pr == 0)

	{

		for (y = 0; y<4; y++)

		{

			for (x = 0; x<4; x++)

			{

				setCursor(cursor.X + (x * 2), cursor.Y + y);

				if (block[rotation][y][x] == 1)

					printf(" ");

			}

		}

		setCursor(cursor.X + move1, cursor.Y + move2);

	}

}





